      ******************************************************************
      * Author: EMIRHAN GURSES
      * Date: 12.24.2023
      * Purpose: EDUCATION
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. INTRODUCTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "IMAGINE A WORLD WITH COBOL"
            DISPLAY "GOOD BYE FOR NOW"
            STOP RUN.
       END PROGRAM INTRODUCTION.
